"use strict";

// объявляем переменные
let cels;  // температура в градусах Цельсия
let far;   // температура в градусах Фаренгейта

// запрос температуры в Цельсиях
cels = +prompt("Пожалуйста, введите температуру по шкале Цельсия (например, 10): ");

// проверка корректности ввода
if ( isNaN(cels) ) {

    alert("Некорректный ввод, ожидается, что вы введете число, например, 10");
    
} else {

    far = (9 / 5) * cels + 32;
    alert(`    ${cels} град. по шкале Цельсия соответствует
    ${far} град. по шкале Фаренгейта.`);

}


