
/*

Чему будут равны переменные x и a в примере ниже? Написать почему так произошло
(описать последовательность действий).

*/

let a = 2;              // шаг 1: инициализация переменной 'a' со значением 2 
let x = 1 + (a *= 2);   // шаг 2: действие в скобках
                        //        - вычисляется произведение переменной 'a' и числа 2, получаем 4
                        //        - результат произведения присваивается переменной 'a', в результате 'a' = 4
                        //        - в скобках остается переменная 'a' со значением 4
                        // шаг 3: вычисляется сумма 1 и значения в скобках (то есть 4), получаем 5
                        // шаг 4: инициализация переменной 'x' со значением 5


// в итоге 'x' = 5, 'a' = 4