/*

4. Реализовать основные 4 арифметические операции (+, -, /, *) в виде функций с двумя
параметрами. Т.е. например, функция для сложения должна принимать два числа, складывать их
и возвращать результат.
Обязательно использовать оператор return.

*/

"use strict";


/**
 * Функция складывает два переданных числа
 * @param {number} a первое слагаемое
 * @param {number} b второе слагаемое
 * @returns {number} результат сложения
 */
function add (a, b) {

    return a + b
}

/**
 * Функция производит вычитание второго переданного числа из первого
 * @param {number} a уменьшаемое
 * @param {number} b вычитаемое
 * @returns {number} результат вычитания (разность)
 */
function sub (a, b) {

    return a - b
}

/**
 * Функция перемножает два переданных числа
 * @param {number} a множимое
 * @param {number} b множитель
 * @returns {number} результат умножения (произведение)
 */
function mul (a, b) {
    
    return a * b
}


/**
 * Функция делит первое переданное число на второе
 * @param {number} a делимое
 * @param {number} b делитель
 * @returns {number} результат деления (частное)
 */
function div (a, b) {

    return a / b
}




// ввод входных аргументов
let a = parseInt( prompt("Введите первое число: "));
let b = parseInt( prompt("Введите второе число: "));

// проверка корректности ввода (ожидаем числа)
if ( ( isNaN(a) ) || ( isNaN(b) ) ) {
    
    alert("Необходимо ввести числа!");

} else {

    // аргументы прошли проверку
    alert(`    ${a} + ${b} = ${add(a, b)},
    ${a} - ${b} = ${sub(a, b)},
    ${a} * ${b} = ${mul(a, b)},
    ${a} / ${b} = ${div(a, b)}`);
}
