/*

. Объявить две переменные a и b и задать им целочисленные произвольные начальные
значения.
Затем написать скрипт, который работает по следующему принципу:
- если a и b положительные, вывести их разность (ноль можно считать положительным числом);
- если а и b отрицательные, вывести их произведение;
- * (этот пункт по сложнее, делайте по желанию) если а и b разных знаков, вывести их сумму;

*/


"use strict";

let a = parseInt(prompt("Введие числовое значение для переменной А :"));
let b = parseInt(prompt("...а теперь числовое значение для переменной B :"));

let result; // переменная для хранения результата вычисления

// условие 1 : оба положительные
if ( (a >= 0) && (b >= 0) ) {
 
    result = a - b;
    alert(`оба числа больше или равны нулю, вычисляем разность: ${a} - ${b} = ${result}`);

// условие 2 : оба отрицательные
} else if ( (a < 0) && (b < 0) ) {
 
    result = a * b;
    alert(`оба числа отрицательные, вычисляем произведение: ( ${a} ) * ( ${b} ) = ${result}`);

// условие 3 : оба разных знаков
} else {
 
    result = a + b;
    alert(`числа имеют разные знаки, вычисляем сумму: ( ${a} ) + ( ${b} ) = ${result}`);
}

