/*

6. Нарисовать горку с помощью console.log (используя цикл for), как показано на рисунке,
только у вашей горки должно быть 20 рядов, а не 5:
x
xx
xxx
xxxx
xxxxx

*/

"use strict";

// цикл по строчкам 20 проходов
for(let i = 1; i < 21; i++) {
    
    // инициализируем нулевую строку для хранения символов "x" в текущей строке
    let string = "";

    //цикл внутри каждой строчки - количество проходов равно номеру строки i
    for(let j = 1; j < i + 1; j++) {
        string += "x";
    }
    
    //  вывод текущей строки
    console.log(string);
}