/*

1. С помощью цикла for написать алгоритм для вывода чисел от 0 до 10 включительно, чтобы результат выглядел так:
0 – это ноль
1 – нечетное число
2 – четное число
3 – нечетное число
…
10 – четное число
Для решения этой задачи используйте остаток от деления на 2, подробнее здесь
https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Operators/Arithmetic_Operators

*/

"use strict";

/**
 * Функция осуществляет вывод информации о переданном числе: либо 0, либо четное, либо нечетное число
 * @param {number} i число, в отношении которого принимается решение, четное оно или нет
 */
function makeOutput( i ) {
    // выявление нуля
    if ( i == 0 ) {
        console.log( i + " - это ноль");
        return
    }

    // выявление четных чисел
    if ( i % 2 == 0 ) {
        console.log( i + " - четное число");
        return
    }

    // выявление нечетных чисел
    if ( i % 2 == 1 ) {
        console.log( i + " - нечетное число");
        return
    }

}

// цикл с перебором аргумента от 0 до 10
for(let i = 0; i < 11; i++) {
    makeOutput( i );
} 