/*

Объясните почему код даёт именно такие результаты?

*/

//пример 1
let a = 1, b = 1, c, d;
c = ++a;   // префиксная форма инкремента выполняется до присваивания
           //     шаг 1: значение переменной 'a' увеличивается на 1, в результате 'a' = 2
           //     шаг 2: новое значение переменной 'a' присваивается переменной 'c', в результате 'c' = 2
alert(c); // ответ: 2



//пример 2
d = b++;   // постфиксная форма инкремента выполняется после присваивания
           //     шаг 3: переменной 'd' присваивается начальное 'b', в результате 'd' = 1
           //     шаг 4: инкремент 'b' в результате 'b' = 2
alert(d); //ответ: 1



//пример 3
c = 2 + ++a;  // префиксная форма инкремента выполняется до присваивания
              // шаг 5: инкремент 'a' после шага 1 (текущее значение 2), в результате 'a' = 3
              // шаг 6: сложение 2 и нового значения 'a', в результате сумма составляет 5 
              // шаг 7: присваивание суммы переменной 'c', в результате 'c' = 5
alert(c); //ответ: 5



//пример 4
d = 2 + b++;  // постфиксная форма инкремента выполняется после присваивания
              // шаг 8: вычисляется сумма 2 и текущего значения 'b', то есть 2, в результате 4
              // шаг 9: результат сложения присваивается переменной 'd', в результате 'd' = 4
              // шаг 10: осуществляется инкремент 'b', в результате 'b' = 3

alert(d); //ответ: 4    - после шага 9
alert(a); //3           - после шага 5
alert(b); //3           - после шага 10
